#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/ElettroAle/shared-infrastructure/runs/run-Lo36dLyzCFmHgQ3b

Waiting for the plan to start...

Terraform v1.3.6
on linux_amd64
Initializing plugins and modules...
azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/4340d382-f8e5-4753-a006-da8cbc11955a/resourceGroups/rg-cluster]
module.cluster.azurerm_container_registry.acr: Refreshing state... [id=/subscriptions/4340d382-f8e5-4753-a006-da8cbc11955a/resourceGroups/rg-cluster/providers/Microsoft.ContainerRegistry/registries/crclusterprod]
module.cluster.azurerm_kubernetes_cluster.aks: Refreshing state... [id=/subscriptions/4340d382-f8e5-4753-a006-da8cbc11955a/resourceGroups/rg-cluster/providers/Microsoft.ContainerService/managedClusters/aks-cluster-prod]
module.cluster.azurerm_role_assignment.rbac: Refreshing state... [id=/subscriptions/4340d382-f8e5-4753-a006-da8cbc11955a/resourceGroups/rg-cluster/providers/Microsoft.ContainerRegistry/registries/crclusterprod/providers/Microsoft.Authorization/roleAssignments/ce0c2c16-ff20-4abf-3c49-19b239f1af6a]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # azurerm_dns_a_record.a_record will be created
  + resource "azurerm_dns_a_record" "a_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "elettroale.com"
      + records             = [
          + "b4bf4a1f-5079-4779-909a-d963ce6cbe2b",
        ]
      + resource_group_name = "rg-cluster"
      + ttl                 = 3600
      + zone_name           = "elettroale.com"
    }

  # azurerm_dns_zone.zone will be created
  + resource "azurerm_dns_zone" "zone" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "elettroale.com"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "rg-cluster"

      + soa_record {
          + email         = (known after apply)
          + expire_time   = (known after apply)
          + fqdn          = (known after apply)
          + host_name     = (known after apply)
          + minimum_ttl   = (known after apply)
          + refresh_time  = (known after apply)
          + retry_time    = (known after apply)
          + serial_number = (known after apply)
          + tags          = (known after apply)
          + ttl           = (known after apply)
        }
    }

  # module.cluster.data.azurerm_public_ip.ip will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_public_ip" "ip" {
      + allocation_method       = (known after apply)
      + ddos_protection_mode    = (known after apply)
      + ddos_protection_plan_id = (known after apply)
      + domain_name_label       = (known after apply)
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = (known after apply)
      + ip_address              = (known after apply)
      + ip_tags                 = (known after apply)
      + ip_version              = (known after apply)
      + location                = (known after apply)
      + name                    = "b4bf4a1f-5079-4779-909a-d963ce6cbe2b"
      + resource_group_name     = "MC_rg-cluster_aks-cluster-prod_westeurope"
      + reverse_fqdn            = (known after apply)
      + sku                     = (known after apply)
      + tags                    = (known after apply)
      + zones                   = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.cluster.azurerm_kubernetes_cluster.aks will be updated in-place
  ~ resource "azurerm_kubernetes_cluster" "aks" {
      + api_server_authorized_ip_ranges     = (known after apply)
        id                                  = "/subscriptions/4340d382-f8e5-4753-a006-da8cbc11955a/resourceGroups/rg-cluster/providers/Microsoft.ContainerService/managedClusters/aks-cluster-prod"
        name                                = "aks-cluster-prod"
        tags                                = {}
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 2 to add, 1 to change, 0 to destroy.


```

</details>

*Pushed by: @ElettroAle, Action: `pull_request`*